nxp-mcuxpresso/mcuxsdk-examples/_boards/kw47evk/project_template/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCANPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCANPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t CAN_TX = {/* Internal pull-up/down resistor is disabled */
                                      .pullSelect = (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as CAN0_TX */
                                      .mux = (uint16_t)kPORT_MuxAlt3,
                                      /* Digital input is not inverted */
                                      .invertInput = (uint16_t)kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTC4 (pin 42) is configured as CAN0_TX */
    PORT_SetPinConfig(BOARD_INITCANPINS_CAN_TX_PORT, BOARD_INITCANPINS_CAN_TX_PIN, &CAN_TX);

    const port_pin_config_t CAN_RX = {/* Internal pull-up/down resistor is disabled */
                                      .pullSelect = (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as CAN0_RX */
                                      .mux = (uint16_t)kPORT_MuxAlt3,
                                      /* Digital input is not inverted */
                                      .invertInput = (uint16_t)kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTC5 (pin 43) is configured as CAN0_RX */
    PORT_SetPinConfig(BOARD_INITCANPINS_CAN_RX_PORT, BOARD_INITCANPINS_CAN_RX_PIN, &CAN_RX);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitFlashPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '47', peripheral: LPSPI1, signal: IN, pin_signal: ADC0_B11/PTB1/LPSPI1_SIN/CAN1_TX/TPM1_CH1/FLEXIO0_D27, identifier: FLASH_SIN, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '1', peripheral: LPSPI1, signal: OUT, pin_signal: ADC0_B13/PTB3/WUU0_P14/LPSPI1_SOUT/LPUART1_RX/TPM1_CH3/FLEXIO0_D29, identifier: FLASH_SOUT, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '46', peripheral: LPSPI1, signal: PCS0, pin_signal: ADC0_B10/PTB0/WUU0_P13/LPSPI1_PCS0/CAN1_RX/TPM1_CH0/FLEXIO0_D26, identifier: FLASH_CS, pull_select: down,
    pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '48', peripheral: LPSPI1, signal: SCK, pin_signal: ADC0_B12/PTB2/LPSPI1_SCK/LPUART1_TX/TPM1_CH2/FLEXIO0_D28, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlashPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitFlashPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t FLASH_CS = {/* Internal pull-up/down resistor is disabled */
                                        .pullSelect = (uint16_t)kPORT_PullDisable,
                                        /* Low internal pull resistor value is selected. */
                                        .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                        /* Fast slew rate is configured */
                                        .slewRate = (uint16_t)kPORT_FastSlewRate,
                                        /* Passive input filter is disabled */
                                        .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                        /* Open drain output is disabled */
                                        .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                        /* Low drive strength is configured */
                                        .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                        /* Normal drive strength is configured */
                                        .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                        /* Pin is configured as LPSPI1_PCS0 */
                                        .mux = (uint16_t)kPORT_MuxAlt2,
                                        /* Digital input is not inverted */
                                        .invertInput = (uint16_t)kPORT_InputNormal,
                                        /* Pin Control Register fields [15:0] are not locked */
                                        .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB0 (pin 46) is configured as LPSPI1_PCS0 */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_CS_PORT, BOARD_INITFLASHPINS_FLASH_CS_PIN, &FLASH_CS);

    const port_pin_config_t FLASH_SIN = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPSPI1_SIN */
                                         .mux = (uint16_t)kPORT_MuxAlt2,
                                         /* Digital input is not inverted */
                                         .invertInput = (uint16_t)kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB1 (pin 47) is configured as LPSPI1_SIN */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SIN_PORT, BOARD_INITFLASHPINS_FLASH_SIN_PIN, &FLASH_SIN);

    const port_pin_config_t FLASH_SCK = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPSPI1_SCK */
                                         .mux = (uint16_t)kPORT_MuxAlt2,
                                         /* Digital input is not inverted */
                                         .invertInput = (uint16_t)kPORT_InputNormal,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB2 (pin 48) is configured as LPSPI1_SCK */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SCK_PORT, BOARD_INITFLASHPINS_FLASH_SCK_PIN, &FLASH_SCK);

    const port_pin_config_t FLASH_SOUT = {/* Internal pull-up/down resistor is disabled */
                                          .pullSelect = (uint16_t)kPORT_PullDisable,
                                          /* Low internal pull resistor value is selected. */
                                          .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                          /* Fast slew rate is configured */
                                          .slewRate = (uint16_t)kPORT_FastSlewRate,
                                          /* Passive input filter is disabled */
                                          .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                          /* Open drain output is disabled */
                                          .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                          /* Normal drive strength is configured */
                                          .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                          /* Pin is configured as LPSPI1_SOUT */
                                          .mux = (uint16_t)kPORT_MuxAlt2,
                                          /* Digital input is not inverted */
                                          .invertInput = (uint16_t)kPORT_InputNormal,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB3 (pin 1) is configured as LPSPI1_SOUT */
    PORT_SetPinConfig(BOARD_INITFLASHPINS_FLASH_SOUT_PORT, BOARD_INITFLASHPINS_FLASH_SOUT_PIN, &FLASH_SOUT);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACCELPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '3', peripheral: LPI2C1, signal: SCL, pin_signal: PTB5/LPSPI1_PCS2/LPUART1_RTS_b/LPI2C1_SCL/I3C0_SCL/TRGMUX0_OUT0/FLEXIO0_D31, pull_select: up, pull_enable: enable,
    slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, drive_strength_1: normal, invert_input: disable}
  - {pin_num: '2', peripheral: LPI2C1, signal: SDA, pin_signal: PTB4/WUU0_P15/LPSPI1_PCS3/LPUART1_CTS_b/LPI2C1_SDA/I3C0_SDA/TRGMUX0_IN0/FLEXIO0_D30, pull_select: up,
    pull_enable: enable, pull_value: low, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, drive_strength_1: normal, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

