nxp-mcuxpresso/mcuxsdk-examples/_boards/kw47evk/project_template/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACCELPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACCELPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    const port_pin_config_t I2C_SDA_FXLS = {/* Internal pull-up resistor is enabled */
                                            .pullSelect = (uint16_t)kPORT_PullUp,
                                            /* Low internal pull resistor value is selected. */
                                            .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                            /* Fast slew rate is configured */
                                            .slewRate = (uint16_t)kPORT_FastSlewRate,
                                            /* Passive input filter is disabled */
                                            .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                            /* Open drain output is disabled */
                                            .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                            /* Low drive strength is configured */
                                            .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                            /* Normal drive strength is configured */
                                            .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                            /* Pin is configured as LPI2C1_SDA */
                                            .mux = (uint16_t)kPORT_MuxAlt4,
                                            /* Digital input is not inverted */
                                            .invertInput = (uint16_t)kPORT_InputNormal,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB4 (pin 2) is configured as LPI2C1_SDA */
    PORT_SetPinConfig(BOARD_INITACCELPINS_I2C_SDA_FXLS_PORT, BOARD_INITACCELPINS_I2C_SDA_FXLS_PIN, &I2C_SDA_FXLS);

    const port_pin_config_t I2C_SCL_FXLS = {/* Internal pull-up resistor is enabled */
                                            .pullSelect = (uint16_t)kPORT_PullUp,
                                            /* Low internal pull resistor value is selected. */
                                            .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                            /* Fast slew rate is configured */
                                            .slewRate = (uint16_t)kPORT_FastSlewRate,
                                            /* Passive input filter is disabled */
                                            .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                            /* Open drain output is disabled */
                                            .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                            /* Low drive strength is configured */
                                            .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                            /* Normal drive strength is configured */
                                            .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                            /* Pin is configured as LPI2C1_SCL */
                                            .mux = (uint16_t)kPORT_MuxAlt4,
                                            /* Digital input is not inverted */
                                            .invertInput = (uint16_t)kPORT_InputNormal,
                                            /* Pin Control Register fields [15:0] are not locked */
                                            .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB5 (pin 3) is configured as LPI2C1_SCL */
    PORT_SetPinConfig(BOARD_INITACCELPINS_I2C_SCL_FXLS_PORT, BOARD_INITACCELPINS_I2C_SCL_FXLS_PIN, &I2C_SCL_FXLS);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLINPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '11', peripheral: LPUART0, signal: RX, pin_signal: ADC0_A12/PTA16/WUU0_P19/RF_NOT_ALLOWED/LPSPI0_PCS0/EWM0_OUT_b/LPI2C0_SCLS/TPM0_CH4/LPUART0_RX/RF_GPO_8/FLEXIO0_D5,
    identifier: LIN_RX, pull_select: up, pull_enable: enable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '12', peripheral: LPUART0, signal: TX, pin_signal: ADC0_A13/PTA17/WUU0_P3/RF_NOT_ALLOWED/LPSPI0_SIN/EWM0_IN/LPI2C0_SDAS/TPM0_CH5/LPUART0_TX/RF_GPO_7/RF_GPO_8/FLEXIO0_D6,
    identifier: LIN_TX, pull_select: up, pull_enable: enable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
  - {pin_num: '45', peripheral: GPIOC, signal: 'GPIO, 7', pin_signal: PTC7/WUU0_P12/RF_NOT_ALLOWED/TRGMUX0_IN3/TRGMUX0_OUT3/SFA0_CLK/TPM1_CLKIN/TPM2_CLKIN/CLKOUT/FLEXIO0_D23/NMI_b,
    direction: OUTPUT, gpio_init_state: 'true', pull_select: down, pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low, invert_input: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLINPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLINPins(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioC);
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

