nxp-mcuxpresso/mcuxsdk-examples/_boards/kw47evk/project_template/cm33_core0/pin_mux.c
    gpio_pin_config_t LIN_SLP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 45)  */
    GPIO_PinInit(BOARD_INITLINPINS_LIN_SLP_GPIO, BOARD_INITLINPINS_LIN_SLP_PIN, &LIN_SLP_config);

    const port_pin_config_t LIN_RX = {/* Internal pull-up resistor is enabled */
                                      .pullSelect = (uint16_t)kPORT_PullUp,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as LPUART0_RX */
                                      .mux = (uint16_t)kPORT_MuxAlt6,
                                      /* Digital input is not inverted */
                                      .invertInput = (uint16_t)kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTA16 (pin 11) is configured as LPUART0_RX */
    PORT_SetPinConfig(BOARD_INITLINPINS_LIN_RX_PORT, BOARD_INITLINPINS_LIN_RX_PIN, &LIN_RX);

    const port_pin_config_t LIN_TX = {/* Internal pull-up resistor is enabled */
                                      .pullSelect = (uint16_t)kPORT_PullUp,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as LPUART0_TX */
                                      .mux = (uint16_t)kPORT_MuxAlt6,
                                      /* Digital input is not inverted */
                                      .invertInput = (uint16_t)kPORT_InputNormal,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTA17 (pin 12) is configured as LPUART0_TX */
    PORT_SetPinConfig(BOARD_INITLINPINS_LIN_TX_PORT, BOARD_INITLINPINS_LIN_TX_PIN, &LIN_TX);

    const port_pin_config_t LIN_SLP = {/* Internal pull-up/down resistor is disabled */
                                       .pullSelect = (uint16_t)kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       .slewRate = (uint16_t)kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                       /* Pin is configured as PTC7 */
                                       .mux = (uint16_t)kPORT_MuxAsGpio,
                                       /* Digital input is not inverted */
                                       .invertInput = (uint16_t)kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTC7 (pin 45) is configured as PTC7 */
    PORT_SetPinConfig(BOARD_INITLINPINS_LIN_SLP_PORT, BOARD_INITLINPINS_LIN_SLP_PIN, &LIN_SLP);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
